proyecto_duete/app/Models/categoria_Model.php

SELECT *
FROM `categorias`
---
    public function getCategorias(){
        return $this->findAll();