proyecto_duete/app/Models/producto_Model.php

    public function getProductoAll(){
        $builder = $this->getBuilderProductos();
        //se consulta a la base de datos para recuperar todos los registros por id, de forma descendente.
        $builder->select('*', 'id', 'DESC');
        return $this->findAll();
---
SELECT *
FROM `productos`

    public function getProductosByCategoria($categoriaId) {
        return $this->where('categoria_id', $categoriaId)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
WHERE `categoria_id` = '5'
ORDER BY `id` DESC