proyecto_duete/app/Controllers/account_controller.php

    public function cuenta(){
        $ventasCabeceraModel = new ventas_cabecera_Model();
        $data['venta'] = $ventasCabeceraModel->where('usuario_id', session()->get('id_usuario'))->first();
---
SELECT *
FROM `ventas_cabecera`
WHERE `usuario_id` = '35'
 LIMIT 1