proyecto_duete/app/Controllers/carrito_controller.php

SELECT *
FROM `productos`
WHERE `categoria_id` = 2
AND `eliminado` = 'NO'
ORDER BY RAND()
SELECT *
FROM `productos`
WHERE `categoria_id` = 5
AND `eliminado` = 'NO'
ORDER BY RAND()
SELECT *
FROM `productos`
WHERE `categoria_id` = 3
AND `eliminado` = 'NO'
ORDER BY RAND()
---
    public function paginaPrincipal(){
        $productoModel = new producto_Model();
        $data['productosObraGruesa'] = $productoModel->where('categoria_id', 2)->where('eliminado', 'NO')->orderBy('RAND()')->findAll();
        $data['productosHerramientas'] = $productoModel->where('categoria_id', 5)->where('eliminado', 'NO')->orderBy('RAND()')->findAll();
        $data['productosLadrillos'] = $productoModel->where('categoria_id', 3)->where('eliminado', 'NO')->orderBy('RAND()')->findAll();