proyecto_duete/app/Controllers/crud_usuarios_controller.php

SELECT *
FROM `usuarios`
ORDER BY `id_usuario` ASC
---
    public function index(){
        $userModel = new usuario_Model();
        $data['users'] = $userModel->orderBy('id_usuario', 'ASC')->findAll();