proyecto_duete/app/Controllers/ventas_controller.php

SELECT *
FROM `ventas_cabecera`
ORDER BY `id` DESC
---
    public function todas_ventas(){
        $ventasCabeceraModel = new ventas_cabecera_Model();

        $data['aux'] = 0;
        $data['ventas'] = $ventasCabeceraModel->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `ventas_cabecera`
WHERE `id` = '22'
 LIMIT 1
SELECT *
FROM `ventas_detalle`
WHERE `venta_id` = '22'
ORDER BY `id` ASC
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '46'
 LIMIT 1
SELECT *
FROM `productos`
WHERE `id` = '70'
 LIMIT 1
---
    public function verFacturaAdm($id) {
        $ventasCabeceraModel = new ventas_cabecera_Model();
        $ventasDetalleModel = new ventas_detalle_Model();
        $productoModel = new producto_Model();
        $usuarios = new usuario_Model();

        $data['cabecera'] = $ventasCabeceraModel->where('id', $id)->first();
        if (empty($data['cabecera'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('No se encuentra la venta seleccionada.');
        }
        else {
            $data['detalles'] = $ventasDetalleModel->where('venta_id', $id)
            ->orderBy('id', 'ASC')
            ->findAll();
            $data['usuario'] = $usuarios->where('id_usuario', $data['cabecera']['usuario_id'])->first();

            foreach ($data['detalles'] as &$detalle) {
                $producto = $productoModel->where('id', $detalle['producto_id'])->first();